# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Estudos de Caso com Matrizes
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS:   H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}

* Configuração                                                     :noexport:

#+BEGIN_SRC emacs-lisp
(setq org-latex-listings 'minted
      org-latex-packages-alist '(("" "minted"))
      org-latex-pdf-process
      '("pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"
        "pdflatex -shell-escape -interaction nonstopmode -output-directory %o %f"))
(setq org-latex-minted-options
       '(("frame" "lines")
         ("fontsize" "\\scriptsize")))
#+END_SRC

#+RESULTS:
| frame    | lines       |
| fontsize | \scriptsize |
* (#2) Teste

#+BEGIN_EXPORT latex
\begin{tiny}
\begin{bmatrix}
0 & 0 & -1 & 0 & 2 \\
-3 & 0 & 0 & 4 & 0 \\
0 & -5 & 0 & 0 & 0 \\
0 & 0 & 0 & 6 & 0 \\
0 & -7 & 0 & 6 & 8 \\
\end{bmatrix}\to
\begin{bmatrix}
-1 & 0 & 2 \\
 2 & 0 & 4 \\
-3 & 1 & 0 \\
 4 & 1 & 3 \\
-5 & 2 & 2 \\
 6 & 3 & 3 \\
-7 & 4 & 1 \\
 6 & 4 & 3 \\
 8 & 4 & 4 \\
\end{bmatrix}
\end{tiny}
#+END_EXPORT

Vejamos

#+attr_latex: :options fontsize=\tiny
#+begin_src bash :results output :session :exports both
gcc a17-esparsa.c
echo "0 0 -1 0 2 -3 0 0 4 0 0 -5 0 0 0 0 0 0 6 0 0 -7 0 6 8" | ./a.out
#+END_SRC

#+RESULTS:
#+begin_example
Elemento [0][0]: Elemento [0][1]: Elemento [0][2]: Elemento [0][3]: Elemento [0][4]: Elemento [1][0]: Elemento [1][1]: Elemento [1][2]: Elemento [1][3]: Elemento [1][4]: Elemento [2][0]: Elemento [2][1]: Elemento [2][2]: Elemento [2][3]: Elemento [2][4]: Elemento [3][0]: Elemento [3][1]: Elemento [3][2]: Elemento [3][3]: Elemento [3][4]: Elemento [4][0]: Elemento [4][1]: Elemento [4][2]: Elemento [4][3]: Elemento [4][4]: 
Esparsa
 0  0 -1  0  2 
-3  0  0  4  0 
 0 -5  0  0  0 
 0  0  0  6  0 
 0 -7  0  6  8 
Condensada
-1  0  2 
 2  0  4 
-3  1  0 
 4  1  3 
-5  2  1 
 6  3  3 
-7  4  1 
 6  4  3 
 8  4  4 
#+end_example

